# task 01 == Виправте синтаксичні помилки
print("Hello", end=" ")
print("world!")

# task 02 == Виправте синтаксичні помилки
hello = "Hello"
world = "world"
if True:
    print(f"{hello} {world}!")

# task 03  == Вставте пропущену змінну у ф-цію print
for letter in "Hello world!":
    print(letter)

# task 04 == Зробіть так, щоб кількість бананів була
# завжди в чотири рази більша, ніж яблук
apples = 2
banana = apples * 4

# task 05 == виправте назви змінних
storona_1 = 1
storona_2 = 2
storona_3 = 3
storona_4 = 4

# task 06 == Підрахуйте периметр фігури з task 05
# та виведіть його для користувача
perimeter = storona_1 + storona_2 + storona_3 + storona_4
print(perimeter)

"""
    # Задачі 07 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""
# task 07
"""
У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?
"""
apples = 4  #Кількість яблунь, які посадили
pears = 5 + apples  #Обчислюємо кількість груш, які посадили
plum = apples - 2  #Обчислюємо кількість слив, які посадили
all_trees = apples + pears + plum  #Підраховуємо загальну кількість дерев, що посадили
print("Всього в саду посадили", all_trees, "дерев.")  #Виводимо відповідь

# task 08
"""
До обіду температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?
"""
morning = 5  #Ранкова температура
afternoon = morning - 10  #Обчислюємо яка стала температура після обіду
evening = afternoon + 4  #Обчислюємо яка стала температура надвечір
print("Надвечір температура становила", evening, "градус.")  #Виводимо відповідь

# task 09
"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скільки сьогодні дітей у театральному гуртку?
"""
boys = 24  #Загальна кількість хлопчиків у гуртку
girls = boys // 2  #Обчислюємо загальну кількість дівчаток у гуртку
today_boys = boys - 1  #Обчислюємо кількість хлопчиків, що прийшли сьогодні
today_girls = girls - 2  #Обчислюємо кількість дівчаток, що прийшли сьогодні
today_kids = today_boys + today_girls  #Підраховуємо загальну кількість дітей, що прийшли сьогодні
print("Сьогодні у театральному гуртку", today_kids, "дитини.")  #Виводимо відповідь

# task 10
"""
Перша книжка коштує 8 грн., друга - на 2 грн. дорожче,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""
book_1 = 8  #грн коштує перша книга
book_2 = book_1 + 2  #Обчислюємо скільки грн коштує друга книга
book_3 = (book_1 + book_2) // 2  #Обчислюємо скільки грн коштує третя книга
all_books = book_1 + book_2 + book_3  #Обчислюємо скільки грн коштують всі три книги разом
print(all_books, "грн будуть коштувати всі книги разом, якщо купити по одному примірнику.")  #Виводимо відповідь
