# Є list з числами, порахуйте сумму усіх ПАРНИХ чисел в цьому list

# Приклад списку чисел
my_list = [23, 66, 78, 89, 4, 5, 45, 33, 2, 0, 76]

# Оголошуємо змінну - відправну точку
even_summ = 0

# Проходимось циклом по списку і, за умови парності числа, плюсуємо його до змінної
for numbers in my_list:
    if numbers % 2 == 0:
        even_summ += numbers
print(even_summ)

# Також альтернативно можна додати умови, якщо список містить не тільки числа, але й інші типи даних
lst1 = ['1', '2', 3, True, 88, 'False', 5, '6', 7.0, 8.1, 'Python', 9, 0, 'Lorem Ipsum', 4, 56]

# Оголошуємо змінну - відправну точку
lst1_even_summ = 0

# Проходимось циклом по списку і додаємо кілька умов:
# 1)Визначення того, що елемент списка є числом;
# 2)Визначення того, що елемент списка не є булевим значенням (за умови,
# якщо ми захочемо плюсувати непарні числа, щоб не плюсовались Тру елементи(за їх наявності));
# 3)Визначення парності числа

for numbers in lst1:
    if isinstance(numbers, int) and not isinstance(numbers, bool) and numbers % 2 == 0:
        lst1_even_summ += numbers
print(lst1_even_summ)